Repository: PhilippHaumacher/wizard-game
Catalog: flutter_ui/lib/l10n/app_*.arb
Languages: de

source: Connecting...
de: Verbinde...

source: No Connection
de: Keine Verbindung

source: Connect
de: Verbinden

source: Logging in...
de: Anmeldung...

# joinGame
source: Join a game
de: Spiel beitreten

source: No open games.
de: Keine offenen Spiele.

source: You
de: Du

source: Connection lost
de: Verbindung verloren

source: Re-Connect
de: Neu verbinden

source: Reconnecting...
de: Verbinde neu...

source: Waiting for players
de: Warte auf Mitspieler

source: Waiting for other players...
de: Warte auf die Mitspieler...

# noPlayers
source: No players in this game.
de: Keine Sieler in diesem Spiel.

source: Joining game...
de: Betrete Spiel...

source: Waiting for start...
de: Warte auf Start...

# round
source: Round {n} of {rounds}
de: Runde {n} von {rounds}

source: Waiting for cards...
de: Warte auf Karten...

source: Waiting for bid request...
de: Warte auf Aufforderung zur Vorhersage...

# selectsTrump
source: {player} selects the trump color...
de: {player} wählt die Trumpffarbe...

# waitingForBid
source: Waiting for {player}'s bid.
de: Warte auf {player}s Vorhersage.

source: You make the trick!
de: Du machst den Stich!

source: {player} makes the trick!
de: {player} macht den Stich!

# youGetPoints
source: You get {points} points!
de: Du erhälst {points} Punkte!

# selectTrump
source: Select the trump color!
de: Wähle die Trumpffarbe!

source: It's your turn!
de: Du bist am Zug!

source: Waiting for {player}'s card.
de: Warte auf {player}s Karte.

source: Place your bid!
de: Mache deine Vorhersage!

# login
source: Login to Wizard server
de: Anmeldung am Wizard-Server

source: Nick name
de: Spielername

source: Nick name must not be empty.
de: Der Spielername darf nicht leer sein.

source: Create account
de: Account anlegen

source: Login failed
de: Login fehlgeschlagen

# reLogin
source: Retry login
de: Neu anmelden
